'''
0. Python是什么类型的语言？
脚本语言、高级语言

1. IDLE是什么？
安装Python解释器时候自带的集成编辑器。

2. print()的作用是什么？
打印输出

3. Python中表示乘法的符号是什么？
*

4. 为什么>>>print('I love fishc.com' * 5)可以正常执行，但>>>print('I love fishc.com' + 5)却报错？
因为('I love fishc.com' * 5)中*表示重复操作，即复制5次前面的字符串。而后面的+两边的字符类型不一样，不能进行计算和连接操作。

5. 如果我需要在一个字符串中嵌入一个双引号，正确的做法是？
在Python中单引号'和双引号"效果是一样的，如果要在字符串中嵌入一个双引号，那么该字符串可以用单引号括起来。比如'I love "小甲鱼"'

6. 为什么我们要使用Python3？Python2到底有什么问题？看起来很多程序员依然都在使用Python2？
龟叔已经说了Python3属于现在和未来，今后的Python肯定是以Python3为发展的大方向。Python2在发展的过程中越来越臃肿，龟叔很不爽，
就决定重写Python，并且不再支持Python2.
至于很多程序员依然在使用Python2，一方面是老程序都是Python2写的，可能一时半会还不能及时更新到Python3，另一方面，人家乐意吧！
'''